Examples/RegionSolvers/cavityAndPlate/0.org/cellDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class        volVectorField;
    object      cellDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        // Field Value
        value           uniform (0 0 0);
    }

    fixedWallsBottom
    {
        type            groovyBC;
        // Field Value
        value           uniform (0 0 0);
        valueExpression "mapped(D)";
        // debugCommonDriver 1;
        // traceScanning 1;
        // traceParsing 1;
    }

    fixedWalls
    {
        // type            fixedValue;
        type zeroGradient;
        // Field Value
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
